[
    {
        "NNQT_istance": "What is the third bodyofwaters in united_statess for areaofcatchments?",
        "correct_NNQT_istance": "What is the third bodyofwaters in united_statess for areaofcatchments?",
        "istances": {
            "first_rel": "http://dbpedia.org/ontology/areaOfCatchment",
            "first_single_entity": "http://dbpedia.org/resource/United_States",
            "first_type": "http://dbpedia.org/ontology/BodyOfWater",
            "second_rel": "http://dbpedia.org/ontology/location"
        },
        "query": "SELECT ?uri WHERE  { \n\t?uri rdf:type <http://dbpedia.org/ontology/BodyOfWater>; <http://dbpedia.org/ontology/areaOfCatchment> ?measure; \n\t<http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/United_States>.} ORDER BY DESC(?measure) LIMIT 1 OFFSET 2",
        "result_set": {
            "head": {
                "link": [],
                "vars": [
                    "uri"
                ]
            },
            "results": {
                "bindings": [
                    {
                        "uri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Fort_Peck_Lake"
                        }
                    }
                ],
                "distinct": false,
                "ordered": true
            }
        }
    },
    {
        "NNQT_istance": "What is the third bodyofwaters in north_americas for areaofcatchments?",
        "correct_NNQT_istance": "What is the third bodyofwaters in north_americas for areaofcatchments?",
        "istances": {
            "first_rel": "http://dbpedia.org/ontology/areaOfCatchment",
            "first_single_entity": "http://dbpedia.org/resource/North_America",
            "first_type": "http://dbpedia.org/ontology/BodyOfWater",
            "second_rel": "http://dbpedia.org/ontology/location"
        },
        "query": "SELECT ?uri WHERE  { \n\t?uri rdf:type <http://dbpedia.org/ontology/BodyOfWater>; <http://dbpedia.org/ontology/areaOfCatchment> ?measure; \n\t<http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/North_America>.} ORDER BY DESC(?measure) LIMIT 1 OFFSET 2",
        "result_set": {
            "head": {
                "link": [],
                "vars": [
                    "uri"
                ]
            },
            "results": {
                "bindings": [
                    {
                        "uri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Lake_Ontario"
                        }
                    }
                ],
                "distinct": false,
                "ordered": true
            }
        }
    },
    {
        "NNQT_istance": "What is the third bodyofwaters in australias for areaofcatchments?",
        "correct_NNQT_istance": "What is the third bodyofwaters in Australias for areaofcatchments?",
        "istances": {
            "first_rel": "http://dbpedia.org/ontology/areaOfCatchment",
            "first_single_entity": "http://dbpedia.org/resource/Australia",
            "first_type": "http://dbpedia.org/ontology/BodyOfWater",
            "second_rel": "http://dbpedia.org/ontology/location"
        },
        "query": "SELECT ?uri WHERE  { \n\t?uri rdf:type <http://dbpedia.org/ontology/BodyOfWater>; <http://dbpedia.org/ontology/areaOfCatchment> ?measure; \n\t<http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Australia>.} ORDER BY DESC(?measure) LIMIT 1 OFFSET 2",
        "result_set": {
            "head": {
                "link": [],
                "vars": [
                    "uri"
                ]
            },
            "results": {
                "bindings": [
                    {
                        "uri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Terrigal_Lagoon"
                        }
                    }
                ],
                "distinct": false,
                "ordered": true
            }
        }
    },
    {
        "NNQT_istance": "What is the third bodyofwaters in austrias for areaofcatchments?",
        "correct_NNQT_istance": "What is the third bodyofwaters in Austrias for areaofcatchments?",
        "istances": {
            "first_rel": "http://dbpedia.org/ontology/areaOfCatchment",
            "first_single_entity": "http://dbpedia.org/resource/Austria",
            "first_type": "http://dbpedia.org/ontology/BodyOfWater",
            "second_rel": "http://dbpedia.org/ontology/location"
        },
        "query": "SELECT ?uri WHERE  { \n\t?uri rdf:type <http://dbpedia.org/ontology/BodyOfWater>; <http://dbpedia.org/ontology/areaOfCatchment> ?measure; \n\t<http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Austria>.} ORDER BY DESC(?measure) LIMIT 1 OFFSET 2",
        "result_set": {
            "head": {
                "link": [],
                "vars": [
                    "uri"
                ]
            },
            "results": {
                "bindings": [
                    {
                        "uri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Wangenitzsee"
                        }
                    }
                ],
                "distinct": false,
                "ordered": true
            }
        }
    },
    {
        "NNQT_istance": "What is the third bodyofwaters in canadas for areaofcatchments?",
        "correct_NNQT_istance": "What is the third bodyofwaters in Canadas for areaofcatchments?",
        "istances": {
            "first_rel": "http://dbpedia.org/ontology/areaOfCatchment",
            "first_single_entity": "http://dbpedia.org/resource/Canada",
            "first_type": "http://dbpedia.org/ontology/BodyOfWater",
            "second_rel": "http://dbpedia.org/ontology/location"
        },
        "query": "SELECT ?uri WHERE  { \n\t?uri rdf:type <http://dbpedia.org/ontology/BodyOfWater>; <http://dbpedia.org/ontology/areaOfCatchment> ?measure; \n\t<http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Canada>.} ORDER BY DESC(?measure) LIMIT 1 OFFSET 2",
        "result_set": {
            "head": {
                "link": [],
                "vars": [
                    "uri"
                ]
            },
            "results": {
                "bindings": [
                    {
                        "uri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Lake_Champlain"
                        }
                    }
                ],
                "distinct": false,
                "ordered": true
            }
        }
    },
    {
        "NNQT_istance": "What is the third bodyofwaters in canton_of_fribourgs for areaofcatchments?",
        "correct_NNQT_istance": "What is the third bodyofwaters in canton_of_fribourgs for areaofcatchments?",
        "istances": {
            "first_rel": "http://dbpedia.org/ontology/areaOfCatchment",
            "first_single_entity": "http://dbpedia.org/resource/Canton_of_Fribourg",
            "first_type": "http://dbpedia.org/ontology/BodyOfWater",
            "second_rel": "http://dbpedia.org/ontology/location"
        },
        "query": "SELECT ?uri WHERE  { \n\t?uri rdf:type <http://dbpedia.org/ontology/BodyOfWater>; <http://dbpedia.org/ontology/areaOfCatchment> ?measure; \n\t<http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Canton_of_Fribourg>.} ORDER BY DESC(?measure) LIMIT 1 OFFSET 2",
        "result_set": {
            "head": {
                "link": [],
                "vars": [
                    "uri"
                ]
            },
            "results": {
                "bindings": [
                    {
                        "uri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Lac_de_Lessoc"
                        }
                    }
                ],
                "distinct": false,
                "ordered": true
            }
        }
    },
    {
        "NNQT_istance": "What is the third bodyofwaters in chinas for areaofcatchments?",
        "correct_NNQT_istance": "What is the third bodyofwaters in chinas for areaofcatchments?",
        "istances": {
            "first_rel": "http://dbpedia.org/ontology/areaOfCatchment",
            "first_single_entity": "http://dbpedia.org/resource/China",
            "first_type": "http://dbpedia.org/ontology/BodyOfWater",
            "second_rel": "http://dbpedia.org/ontology/location"
        },
        "query": "SELECT ?uri WHERE  { \n\t?uri rdf:type <http://dbpedia.org/ontology/BodyOfWater>; <http://dbpedia.org/ontology/areaOfCatchment> ?measure; \n\t<http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/China>.} ORDER BY DESC(?measure) LIMIT 1 OFFSET 2",
        "result_set": {
            "head": {
                "link": [],
                "vars": [
                    "uri"
                ]
            },
            "results": {
                "bindings": [
                    {
                        "uri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Bangda_Lake"
                        }
                    }
                ],
                "distinct": false,
                "ordered": true
            }
        }
    },
    {
        "NNQT_istance": "What is the third bodyofwaters in germanys for areaofcatchments?",
        "correct_NNQT_istance": "What is the third bodyofwaters in Germanys for areaofcatchments?",
        "istances": {
            "first_rel": "http://dbpedia.org/ontology/areaOfCatchment",
            "first_single_entity": "http://dbpedia.org/resource/Germany",
            "first_type": "http://dbpedia.org/ontology/BodyOfWater",
            "second_rel": "http://dbpedia.org/ontology/location"
        },
        "query": "SELECT ?uri WHERE  { \n\t?uri rdf:type <http://dbpedia.org/ontology/BodyOfWater>; <http://dbpedia.org/ontology/areaOfCatchment> ?measure; \n\t<http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Germany>.} ORDER BY DESC(?measure) LIMIT 1 OFFSET 2",
        "result_set": {
            "head": {
                "link": [],
                "vars": [
                    "uri"
                ]
            },
            "results": {
                "bindings": [
                    {
                        "uri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Immerather_Maar"
                        }
                    }
                ],
                "distinct": false,
                "ordered": true
            }
        }
    },
    {
        "NNQT_istance": "What is the third bodyofwaters in russias for areaofcatchments?",
        "correct_NNQT_istance": "What is the third bodyofwaters in Russias for areaofcatchments?",
        "istances": {
            "first_rel": "http://dbpedia.org/ontology/areaOfCatchment",
            "first_single_entity": "http://dbpedia.org/resource/Russia",
            "first_type": "http://dbpedia.org/ontology/BodyOfWater",
            "second_rel": "http://dbpedia.org/ontology/location"
        },
        "query": "SELECT ?uri WHERE  { \n\t?uri rdf:type <http://dbpedia.org/ontology/BodyOfWater>; <http://dbpedia.org/ontology/areaOfCatchment> ?measure; \n\t<http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Russia>.} ORDER BY DESC(?measure) LIMIT 1 OFFSET 2",
        "result_set": {
            "head": {
                "link": [],
                "vars": [
                    "uri"
                ]
            },
            "results": {
                "bindings": [
                    {
                        "uri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Lake_Peipus"
                        }
                    }
                ],
                "distinct": false,
                "ordered": true
            }
        }
    }
]