[
    {
        "NNQT_istance": "Which are the musical artist who wrote more than 2 book?",
        "correct_NNQT_istance": "Which is the musical artist who wrote more than 2 books?",
        "istances": {
            "first_constant": "2",
            "first_type": "http://dbpedia.org/ontology/Book",
            "rel_to_insert": "http://dbpedia.org/ontology/author",
            "second_type": "http://dbpedia.org/ontology/MusicalArtist"
        },
        "query": "select distinct ?otherUri where {select distinct count(?uri) as ?numbooks ?otherUri where {?uri a <http://dbpedia.org/ontology/Book>. \n\t?otherUri a <http://dbpedia.org/ontology/MusicalArtist>. \n\t?uri <http://dbpedia.org/ontology/author> ?otherUri.}\n\tGROUP BY ?otherUri HAVING(count(?uri)>2)}",
        "result_set": {
            "head": {
                "link": [],
                "vars": [
                    "otherUri"
                ]
            },
            "results": {
                "bindings": [
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Ian_Page_(singer)"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Colin_Meloy"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Bob_Dylan"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Andrew_Gross"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Julian_Cope"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Patti_Smith"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Vivek_Shraya"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Nick_Cave"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/George_Harrison"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Frank_Portman"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Jimmy_Buffett"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Leonard_Cohen"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Henry_Rollins"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/John_Lennon"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Miles_Tredinnick"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Paul_Bowles"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Willie_Nelson"
                        }
                    }
                ],
                "distinct": false,
                "ordered": true
            }
        }
    },
    {
        "NNQT_istance": "Which are the musical artist who wrote more than 4 book?",
        "correct_NNQT_istance": "Which is the musical artist who wrote more than 4 books?",
        "istances": {
            "first_constant": "4",
            "first_type": "http://dbpedia.org/ontology/Book",
            "rel_to_insert": "http://dbpedia.org/ontology/author",
            "second_type": "http://dbpedia.org/ontology/MusicalArtist"
        },
        "query": "select distinct ?otherUri where {select distinct count(?uri) as ?numbooks ?otherUri where {?uri a <http://dbpedia.org/ontology/Book>. \n\t?otherUri a <http://dbpedia.org/ontology/MusicalArtist>. \n\t?uri <http://dbpedia.org/ontology/author> ?otherUri.}\n\tGROUP BY ?otherUri HAVING(count(?uri)>4)}",
        "result_set": {
            "head": {
                "link": [],
                "vars": [
                    "otherUri"
                ]
            },
            "results": {
                "bindings": [
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Patti_Smith"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Leonard_Cohen"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Willie_Nelson"
                        }
                    }
                ],
                "distinct": false,
                "ordered": true
            }
        }
    },
    {
        "NNQT_istance": "Which are the musical artist who wrote more than 6 book?",
        "correct_NNQT_istance": "Which is the musical artist who wrote more than 6 books?",
        "istances": {
            "first_constant": "6",
            "first_type": "http://dbpedia.org/ontology/Book",
            "rel_to_insert": "http://dbpedia.org/ontology/author",
            "second_type": "http://dbpedia.org/ontology/MusicalArtist"
        },
        "query": "select distinct ?otherUri where {select distinct count(?uri) as ?numbooks ?otherUri where {?uri a <http://dbpedia.org/ontology/Book>. \n\t?otherUri a <http://dbpedia.org/ontology/MusicalArtist>. \n\t?uri <http://dbpedia.org/ontology/author> ?otherUri.}\n\tGROUP BY ?otherUri HAVING(count(?uri)>6)}",
        "result_set": {
            "head": {
                "link": [],
                "vars": [
                    "otherUri"
                ]
            },
            "results": {
                "bindings": [
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Patti_Smith"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Leonard_Cohen"
                        }
                    }
                ],
                "distinct": false,
                "ordered": true
            }
        }
    },
    {
        "NNQT_istance": "Which are the musical artist who wrote more than 8 book?",
        "correct_NNQT_istance": "Which is the musical artist who wrote more than 8 books?",
        "istances": {
            "first_constant": "8",
            "first_type": "http://dbpedia.org/ontology/Book",
            "rel_to_insert": "http://dbpedia.org/ontology/author",
            "second_type": "http://dbpedia.org/ontology/MusicalArtist"
        },
        "query": "select distinct ?otherUri where {select distinct count(?uri) as ?numbooks ?otherUri where {?uri a <http://dbpedia.org/ontology/Book>. \n\t?otherUri a <http://dbpedia.org/ontology/MusicalArtist>. \n\t?uri <http://dbpedia.org/ontology/author> ?otherUri.}\n\tGROUP BY ?otherUri HAVING(count(?uri)>8)}",
        "result_set": {
            "head": {
                "link": [],
                "vars": [
                    "otherUri"
                ]
            },
            "results": {
                "bindings": [
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Patti_Smith"
                        }
                    }
                ],
                "distinct": false,
                "ordered": true
            }
        }
    },
    {
        "NNQT_istance": "Which are the musical artist who wrote more than 10 book?",
        "correct_NNQT_istance": "Which is the musical artist who wrote more than 10 books?",
        "istances": {
            "first_constant": "10",
            "first_type": "http://dbpedia.org/ontology/Book",
            "rel_to_insert": "http://dbpedia.org/ontology/author",
            "second_type": "http://dbpedia.org/ontology/MusicalArtist"
        },
        "query": "select distinct ?otherUri where {select distinct count(?uri) as ?numbooks ?otherUri where {?uri a <http://dbpedia.org/ontology/Book>. \n\t?otherUri a <http://dbpedia.org/ontology/MusicalArtist>. \n\t?uri <http://dbpedia.org/ontology/author> ?otherUri.}\n\tGROUP BY ?otherUri HAVING(count(?uri)>10)}",
        "result_set": {
            "head": {
                "link": [],
                "vars": [
                    "otherUri"
                ]
            },
            "results": {
                "bindings": [
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Patti_Smith"
                        }
                    }
                ],
                "distinct": false,
                "ordered": true
            }
        }
    },
    {
        "NNQT_istance": "Which are the comedian who wrote more than 2 book?",
        "correct_NNQT_istance": "Which is the comedian who wrote more than 2 books?",
        "istances": {
            "first_constant": "2",
            "first_type": "http://dbpedia.org/ontology/Book",
            "rel_to_insert": "http://dbpedia.org/ontology/author",
            "second_type": "http://dbpedia.org/ontology/Comedian"
        },
        "query": "select distinct ?otherUri where {select distinct count(?uri) as ?numbooks ?otherUri where {?uri a <http://dbpedia.org/ontology/Book>. \n\t?otherUri a <http://dbpedia.org/ontology/Comedian>. \n\t?uri <http://dbpedia.org/ontology/author> ?otherUri.}\n\tGROUP BY ?otherUri HAVING(count(?uri)>2)}",
        "result_set": {
            "head": {
                "link": [],
                "vars": [
                    "otherUri"
                ]
            },
            "results": {
                "bindings": [
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Stephen_Colbert"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Steve_Martin"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Russell_Brand"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/George_Carlin"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Bill_Maher"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Jon_Stewart"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Ricky_Gervais"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Garrison_Keillor"
                        }
                    }
                ],
                "distinct": false,
                "ordered": true
            }
        }
    },
    {
        "NNQT_istance": "Which are the comedian who wrote more than 4 book?",
        "correct_NNQT_istance": "Which is the comedian who wrote more than 4 books?",
        "istances": {
            "first_constant": "4",
            "first_type": "http://dbpedia.org/ontology/Book",
            "rel_to_insert": "http://dbpedia.org/ontology/author",
            "second_type": "http://dbpedia.org/ontology/Comedian"
        },
        "query": "select distinct ?otherUri where {select distinct count(?uri) as ?numbooks ?otherUri where {?uri a <http://dbpedia.org/ontology/Book>. \n\t?otherUri a <http://dbpedia.org/ontology/Comedian>. \n\t?uri <http://dbpedia.org/ontology/author> ?otherUri.}\n\tGROUP BY ?otherUri HAVING(count(?uri)>4)}",
        "result_set": {
            "head": {
                "link": [],
                "vars": [
                    "otherUri"
                ]
            },
            "results": {
                "bindings": [
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Stephen_Colbert"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Steve_Martin"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/George_Carlin"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Garrison_Keillor"
                        }
                    }
                ],
                "distinct": false,
                "ordered": true
            }
        }
    },
    {
        "NNQT_istance": "Which are the comics creator who wrote more than 2 book?",
        "correct_NNQT_istance": "Which is the comics creator who wrote more than 2 books?",
        "istances": {
            "first_constant": "2",
            "first_type": "http://dbpedia.org/ontology/Book",
            "rel_to_insert": "http://dbpedia.org/ontology/author",
            "second_type": "http://dbpedia.org/ontology/ComicsCreator"
        },
        "query": "select distinct ?otherUri where {select distinct count(?uri) as ?numbooks ?otherUri where {?uri a <http://dbpedia.org/ontology/Book>. \n\t?otherUri a <http://dbpedia.org/ontology/ComicsCreator>. \n\t?uri <http://dbpedia.org/ontology/author> ?otherUri.}\n\tGROUP BY ?otherUri HAVING(count(?uri)>2)}",
        "result_set": {
            "head": {
                "link": [],
                "vars": [
                    "otherUri"
                ]
            },
            "results": {
                "bindings": [
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Don_Freeman"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Raymond_Briggs"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Shaun_Tan"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Berkeley_Breathed"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Andrew_Cartmel"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/James_A._Owen"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Lawrence_Miles"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Jeff_Smith_(cartoonist)"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Raina_Telgemeier"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Chris_Claremont"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Will_Murray"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Randall_Munroe"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Scott_McCloud"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Guy_Delisle"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Peter_O'Donnell"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Jimmy_Liao"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Peter_David"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Robert_Kirkman"
                        }
                    }
                ],
                "distinct": false,
                "ordered": true
            }
        }
    },
    {
        "NNQT_istance": "Which are the comics creator who wrote more than 4 book?",
        "correct_NNQT_istance": "Which is the comics creator who wrote more than 4 books?",
        "istances": {
            "first_constant": "4",
            "first_type": "http://dbpedia.org/ontology/Book",
            "rel_to_insert": "http://dbpedia.org/ontology/author",
            "second_type": "http://dbpedia.org/ontology/ComicsCreator"
        },
        "query": "select distinct ?otherUri where {select distinct count(?uri) as ?numbooks ?otherUri where {?uri a <http://dbpedia.org/ontology/Book>. \n\t?otherUri a <http://dbpedia.org/ontology/ComicsCreator>. \n\t?uri <http://dbpedia.org/ontology/author> ?otherUri.}\n\tGROUP BY ?otherUri HAVING(count(?uri)>4)}",
        "result_set": {
            "head": {
                "link": [],
                "vars": [
                    "otherUri"
                ]
            },
            "results": {
                "bindings": [
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Raymond_Briggs"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Berkeley_Breathed"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Andrew_Cartmel"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/James_A._Owen"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Lawrence_Miles"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Jeff_Smith_(cartoonist)"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Peter_O'Donnell"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Peter_David"
                        }
                    }
                ],
                "distinct": false,
                "ordered": true
            }
        }
    },
    {
        "NNQT_istance": "Which are the comics creator who wrote more than 6 book?",
        "correct_NNQT_istance": "Which is the comics creator who wrote more than 6 books?",
        "istances": {
            "first_constant": "6",
            "first_type": "http://dbpedia.org/ontology/Book",
            "rel_to_insert": "http://dbpedia.org/ontology/author",
            "second_type": "http://dbpedia.org/ontology/ComicsCreator"
        },
        "query": "select distinct ?otherUri where {select distinct count(?uri) as ?numbooks ?otherUri where {?uri a <http://dbpedia.org/ontology/Book>. \n\t?otherUri a <http://dbpedia.org/ontology/ComicsCreator>. \n\t?uri <http://dbpedia.org/ontology/author> ?otherUri.}\n\tGROUP BY ?otherUri HAVING(count(?uri)>6)}",
        "result_set": {
            "head": {
                "link": [],
                "vars": [
                    "otherUri"
                ]
            },
            "results": {
                "bindings": [
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Berkeley_Breathed"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Andrew_Cartmel"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Lawrence_Miles"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Jeff_Smith_(cartoonist)"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Peter_O'Donnell"
                        }
                    }
                ],
                "distinct": false,
                "ordered": true
            }
        }
    },
    {
        "NNQT_istance": "Which are the comics creator who wrote more than 8 book?",
        "correct_NNQT_istance": "Which is the comics creator who wrote more than 8 books?",
        "istances": {
            "first_constant": "8",
            "first_type": "http://dbpedia.org/ontology/Book",
            "rel_to_insert": "http://dbpedia.org/ontology/author",
            "second_type": "http://dbpedia.org/ontology/ComicsCreator"
        },
        "query": "select distinct ?otherUri where {select distinct count(?uri) as ?numbooks ?otherUri where {?uri a <http://dbpedia.org/ontology/Book>. \n\t?otherUri a <http://dbpedia.org/ontology/ComicsCreator>. \n\t?uri <http://dbpedia.org/ontology/author> ?otherUri.}\n\tGROUP BY ?otherUri HAVING(count(?uri)>8)}",
        "result_set": {
            "head": {
                "link": [],
                "vars": [
                    "otherUri"
                ]
            },
            "results": {
                "bindings": [
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Berkeley_Breathed"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Lawrence_Miles"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Jeff_Smith_(cartoonist)"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Peter_O'Donnell"
                        }
                    }
                ],
                "distinct": false,
                "ordered": true
            }
        }
    },
    {
        "NNQT_istance": "Which are the comics creator who wrote more than 10 book?",
        "correct_NNQT_istance": "Which is the comics creator who wrote more than 10 books?",
        "istances": {
            "first_constant": "10",
            "first_type": "http://dbpedia.org/ontology/Book",
            "rel_to_insert": "http://dbpedia.org/ontology/author",
            "second_type": "http://dbpedia.org/ontology/ComicsCreator"
        },
        "query": "select distinct ?otherUri where {select distinct count(?uri) as ?numbooks ?otherUri where {?uri a <http://dbpedia.org/ontology/Book>. \n\t?otherUri a <http://dbpedia.org/ontology/ComicsCreator>. \n\t?uri <http://dbpedia.org/ontology/author> ?otherUri.}\n\tGROUP BY ?otherUri HAVING(count(?uri)>10)}",
        "result_set": {
            "head": {
                "link": [],
                "vars": [
                    "otherUri"
                ]
            },
            "results": {
                "bindings": [
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Peter_O'Donnell"
                        }
                    }
                ],
                "distinct": false,
                "ordered": true
            }
        }
    },
    {
        "NNQT_istance": "Which are the fashion designer who wrote more than 2 book?",
        "correct_NNQT_istance": "Which is the fashion designer who wrote more than 2 books?",
        "istances": {
            "first_constant": "2",
            "first_type": "http://dbpedia.org/ontology/Book",
            "rel_to_insert": "http://dbpedia.org/ontology/author",
            "second_type": "http://dbpedia.org/ontology/FashionDesigner"
        },
        "query": "select distinct ?otherUri where {select distinct count(?uri) as ?numbooks ?otherUri where {?uri a <http://dbpedia.org/ontology/Book>. \n\t?otherUri a <http://dbpedia.org/ontology/FashionDesigner>. \n\t?uri <http://dbpedia.org/ontology/author> ?otherUri.}\n\tGROUP BY ?otherUri HAVING(count(?uri)>2)}",
        "result_set": {
            "head": {
                "link": [],
                "vars": [
                    "otherUri"
                ]
            },
            "results": {
                "bindings": [
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/William_Baker_(fashion_designer)"
                        }
                    }
                ],
                "distinct": false,
                "ordered": true
            }
        }
    },
    {
        "NNQT_istance": "Which are the comics creator who wrote more than 2 comic?",
        "correct_NNQT_istance": "Which is the comics creator who wrote more than 2 comics?",
        "istances": {
            "first_constant": "2",
            "first_type": "http://dbpedia.org/ontology/Comic",
            "rel_to_insert": "http://dbpedia.org/ontology/author",
            "second_type": "http://dbpedia.org/ontology/ComicsCreator"
        },
        "query": "select distinct ?otherUri where {select distinct count(?uri) as ?numbooks ?otherUri where {?uri a <http://dbpedia.org/ontology/Comic>. \n\t?otherUri a <http://dbpedia.org/ontology/ComicsCreator>. \n\t?uri <http://dbpedia.org/ontology/author> ?otherUri.}\n\tGROUP BY ?otherUri HAVING(count(?uri)>2)}",
        "result_set": {
            "head": {
                "link": [],
                "vars": [
                    "otherUri"
                ]
            },
            "results": {
                "bindings": [
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Mizuki_Kawashita"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Atsushi_\u014ckubo"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Sakura_Tsukuba"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Hiroaki_Samura"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Moto_Hagio"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Akimi_Yoshida"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Hakase_Mizuki"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Saki_Hiwatari"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Kanan_Minami"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Reiko_Shimizu"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Kaneyoshi_Izumi"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Shigeru_Mizuki"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Moyoco_Anno"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Natsume_Ono"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Yoshihiro_Tatsumi"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Makoto_Tateno"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Aya_Nakahara"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Akiko_Higashimura"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Ikki_Kajiwara"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Ryu_Fujisaki"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Ryo_Takamisaki"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/K\u014dhei_Horikoshi"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Masakazu_Katsura"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Yu_Yagami"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Chie_Shinohara"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Fumi_Yoshinaga"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Mohiro_Kitoh"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Katsuhiro_Otomo"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Miki_Yoshikawa"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Tsugumi_Ohba"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Keiko_Nishi"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Kei_Toume"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Takako_Shimura"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Chieko_Hosokawa"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Kiyoko_Arai"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Keiko_Takemiya"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Mitsuru_Hattori"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Izumi_Tsubaki"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Masamune_Shirow"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Nana_Haruta"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Tamayo_Akiyama"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Yoko_Kamio"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Yutaka_Tanaka"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Yoshihiro_Takahashi"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Gosho_Aoyama"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Norihiro_Yagi"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Ryo_Ikuemi"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Shinobu_Ohtaka"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Taiy\u014d_Matsumoto"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Hiromu_Shinozuka"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Masami_Tsuda"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Hinako_Ashihara"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Aya_Kanno"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Suu_Minazuki"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Kazuo_Koike"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Sanami_Matoh"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Matsuri_Hino"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Shuichi_Shigeno"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Takehiko_Inoue"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Hiromu_Arakawa"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Yumi_Tsukirino"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Toshio_Maeda"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Junko_Mizuno"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Tite_Kubo"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Temari_Matsumoto"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/George_Asakura"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Inio_Asano"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Fuyumi_Soryo"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Sakae_Esuno"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Kaiji_Kawaguchi"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Ryoko_Yamagishi"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Riyoko_Ikeda"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Yukito_Kishiro"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Yumi_Tamura"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Ema_T\u014dyama"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Risa_It\u014d"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Milk_Morinaga"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Atsushi_Suzumi"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Shungiku_Nakamura"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Meca_Tanaka"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Natsumi_Itsuki"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Hiroya_Oku"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Yoshihiro_Togashi"
                        }
                    }
                ],
                "distinct": false,
                "ordered": true
            }
        }
    },
    {
        "NNQT_istance": "Which are the comics creator who wrote more than 4 comic?",
        "correct_NNQT_istance": "Which is the comics creator who wrote more than 4 comics?",
        "istances": {
            "first_constant": "4",
            "first_type": "http://dbpedia.org/ontology/Comic",
            "rel_to_insert": "http://dbpedia.org/ontology/author",
            "second_type": "http://dbpedia.org/ontology/ComicsCreator"
        },
        "query": "select distinct ?otherUri where {select distinct count(?uri) as ?numbooks ?otherUri where {?uri a <http://dbpedia.org/ontology/Comic>. \n\t?otherUri a <http://dbpedia.org/ontology/ComicsCreator>. \n\t?uri <http://dbpedia.org/ontology/author> ?otherUri.}\n\tGROUP BY ?otherUri HAVING(count(?uri)>4)}",
        "result_set": {
            "head": {
                "link": [],
                "vars": [
                    "otherUri"
                ]
            },
            "results": {
                "bindings": [
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Moto_Hagio"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Akimi_Yoshida"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Yoshihiro_Tatsumi"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Makoto_Tateno"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Ikki_Kajiwara"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Masakazu_Katsura"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Chie_Shinohara"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Fumi_Yoshinaga"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Katsuhiro_Otomo"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Kiyoko_Arai"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Mitsuru_Hattori"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Masamune_Shirow"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Nana_Haruta"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Yoshihiro_Takahashi"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Taiy\u014d_Matsumoto"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Suu_Minazuki"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Kazuo_Koike"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Inio_Asano"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Riyoko_Ikeda"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Yukito_Kishiro"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Milk_Morinaga"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Hiroya_Oku"
                        }
                    }
                ],
                "distinct": false,
                "ordered": true
            }
        }
    },
    {
        "NNQT_istance": "Which are the comics creator who wrote more than 6 comic?",
        "correct_NNQT_istance": "Which is the comics creator who wrote more than 6 comics?",
        "istances": {
            "first_constant": "6",
            "first_type": "http://dbpedia.org/ontology/Comic",
            "rel_to_insert": "http://dbpedia.org/ontology/author",
            "second_type": "http://dbpedia.org/ontology/ComicsCreator"
        },
        "query": "select distinct ?otherUri where {select distinct count(?uri) as ?numbooks ?otherUri where {?uri a <http://dbpedia.org/ontology/Comic>. \n\t?otherUri a <http://dbpedia.org/ontology/ComicsCreator>. \n\t?uri <http://dbpedia.org/ontology/author> ?otherUri.}\n\tGROUP BY ?otherUri HAVING(count(?uri)>6)}",
        "result_set": {
            "head": {
                "link": [],
                "vars": [
                    "otherUri"
                ]
            },
            "results": {
                "bindings": [
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Moto_Hagio"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Makoto_Tateno"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Ikki_Kajiwara"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Fumi_Yoshinaga"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Masamune_Shirow"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Taiy\u014d_Matsumoto"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Kazuo_Koike"
                        }
                    }
                ],
                "distinct": false,
                "ordered": true
            }
        }
    },
    {
        "NNQT_istance": "Which are the comics creator who wrote more than 8 comic?",
        "correct_NNQT_istance": "Which is the comics creator who wrote more than 8 comics?",
        "istances": {
            "first_constant": "8",
            "first_type": "http://dbpedia.org/ontology/Comic",
            "rel_to_insert": "http://dbpedia.org/ontology/author",
            "second_type": "http://dbpedia.org/ontology/ComicsCreator"
        },
        "query": "select distinct ?otherUri where {select distinct count(?uri) as ?numbooks ?otherUri where {?uri a <http://dbpedia.org/ontology/Comic>. \n\t?otherUri a <http://dbpedia.org/ontology/ComicsCreator>. \n\t?uri <http://dbpedia.org/ontology/author> ?otherUri.}\n\tGROUP BY ?otherUri HAVING(count(?uri)>8)}",
        "result_set": {
            "head": {
                "link": [],
                "vars": [
                    "otherUri"
                ]
            },
            "results": {
                "bindings": [
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Moto_Hagio"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Makoto_Tateno"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Ikki_Kajiwara"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Fumi_Yoshinaga"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Masamune_Shirow"
                        }
                    },
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Kazuo_Koike"
                        }
                    }
                ],
                "distinct": false,
                "ordered": true
            }
        }
    },
    {
        "NNQT_istance": "Which are the comics creator who wrote more than 10 comic?",
        "correct_NNQT_istance": "Which is the comics creator who wrote more than 10 comics?",
        "istances": {
            "first_constant": "10",
            "first_type": "http://dbpedia.org/ontology/Comic",
            "rel_to_insert": "http://dbpedia.org/ontology/author",
            "second_type": "http://dbpedia.org/ontology/ComicsCreator"
        },
        "query": "select distinct ?otherUri where {select distinct count(?uri) as ?numbooks ?otherUri where {?uri a <http://dbpedia.org/ontology/Comic>. \n\t?otherUri a <http://dbpedia.org/ontology/ComicsCreator>. \n\t?uri <http://dbpedia.org/ontology/author> ?otherUri.}\n\tGROUP BY ?otherUri HAVING(count(?uri)>10)}",
        "result_set": {
            "head": {
                "link": [],
                "vars": [
                    "otherUri"
                ]
            },
            "results": {
                "bindings": [
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Fumi_Yoshinaga"
                        }
                    }
                ],
                "distinct": false,
                "ordered": true
            }
        }
    },
    {
        "NNQT_istance": "Which are the comedian who wrote more than 2 play?",
        "correct_NNQT_istance": "Which is the comedian who wrote more than 2 plays?",
        "istances": {
            "first_constant": "2",
            "first_type": "http://dbpedia.org/ontology/Play",
            "rel_to_insert": "http://dbpedia.org/ontology/author",
            "second_type": "http://dbpedia.org/ontology/Comedian"
        },
        "query": "select distinct ?otherUri where {select distinct count(?uri) as ?numbooks ?otherUri where {?uri a <http://dbpedia.org/ontology/Play>. \n\t?otherUri a <http://dbpedia.org/ontology/Comedian>. \n\t?uri <http://dbpedia.org/ontology/author> ?otherUri.}\n\tGROUP BY ?otherUri HAVING(count(?uri)>2)}",
        "result_set": {
            "head": {
                "link": [],
                "vars": [
                    "otherUri"
                ]
            },
            "results": {
                "bindings": [
                    {
                        "otherUri": {
                            "type": "uri",
                            "value": "http://dbpedia.org/resource/Steve_Martin"
                        }
                    }
                ],
                "distinct": false,
                "ordered": true
            }
        }
    }
]